assignment/assignment6/SimpleWebProject/src/tempfiles/out.msg

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><SOAP-ENV:Body><nju:scoreRecord xmlns:nju="http://www.nju.edu.cn/"><studentId>131250059</studentId><courseNumber>00000</courseNumber><scoreType>平时成绩</scoreType><score>69</score></nju:scoreRecord><nju:scoreRecord xmlns:nju="http://www.nju.edu.cn/"><studentId>131250059</studentId><courseNumber>00000</courseNumber><scoreType>期末成绩</scoreType><score>32</score></nju:scoreRecord><nju:scoreRecord xmlns:nju="http://www.nju.edu.cn/"><studentId>131250059</studentId><courseNumber>00000</courseNumber><scoreType>总评成绩</scoreType><score>87</score></nju:scoreRecord><nju:scoreRecord xmlns:nju="http://www.nju.edu.cn/"><studentId>131250059</studentId><courseNumber>00001</courseNumber><scoreType>平时成绩</scoreType><score>42</score></nju:scoreRecord><nju:scoreRecord xmlns:nju="http://www.nju.edu.cn/"><studentId>131250059</studentId><courseNumber>00001</courseNumber><scoreType>期末成绩</scoreType><score>60</score></nju:scoreRecord><nju:scoreRecord xmlns:nju="http://www.nju.edu.cn/"><studentId>131250059</studentId><courseNumber>00001</courseNumber><scoreType>总评成绩</scoreType><score>80</score></nju:scoreRecord><nju:scoreRecord xmlns:nju="http://www.nju.edu.cn/"><studentId>131250059</studentId><courseNumber>00002</courseNumber><scoreType>平时成绩</scoreType><score>37</score></nju:scoreRecord><nju:scoreRecord xmlns:nju="http://www.nju.edu.cn/"><studentId>131250059</studentId><courseNumber>00002</courseNumber><scoreType>期末成绩</scoreType><score>81</score></nju:scoreRecord><nju:scoreRecord xmlns:nju="http://www.nju.edu.cn/"><studentId>131250059</studentId><courseNumber>00002</courseNumber><scoreType>总评成绩</scoreType><score>17</score></nju:scoreRecord><nju:scoreRecord xmlns:nju="http://www.nju.edu.cn/"><studentId>131250059</studentId><courseNumber>00003</courseNumber><scoreType>平时成绩</scoreType><score>20</score></nju:scoreRecord><nju:scoreRecord xmlns:nju="http://www.nju.edu.cn/"><studentId>131250059</studentId><courseNumber>00003</courseNumber><scoreType>期末成绩</scoreType><score>18</score></nju:scoreRecord><nju:scoreRecord xmlns:nju="http://www.nju.edu.cn/"><studentId>131250059</studentId><courseNumber>00003</courseNumber><scoreType>总评成绩</scoreType><score>37</score></nju:scoreRecord><nju:scoreRecord xmlns:nju="http://www.nju.edu.cn/"><studentId>131250059</studentId><courseNumber>00004</courseNumber><scoreType>平时成绩</scoreType><score>30</score></nju:scoreRecord><nju:scoreRecord xmlns:nju="http://www.nju.edu.cn/"><studentId>131250059</studentId><courseNumber>00004</courseNumber><scoreType>期末成绩</scoreType><score>99</score></nju:scoreRecord><nju:scoreRecord xmlns:nju="http://www.nju.edu.cn/"><studentId>131250059</studentId><courseNumber>00004</courseNumber><scoreType>总评成绩</scoreType><score>89</score></nju:scoreRecord></SOAP-ENV:Body></SOAP-ENV:Envelope>